# Написать программу, которая:
# - Запрашивает у пользователя количество строк. (должно быть проверка)
# - Затем сами строки.
# - Определяет, сколько различных слов содержится в этом тексте, и выводит из количество
# Словом считается последовательность непробельных символов идущих подряд, слова разделены одним или большим числом пробелов или символами конца строки.
kolvo = int(input("Введите количество строк: "))  # Просим ввести количество строк
stroki = [input(f"Введите строку под номером {stroka}: ") for stroka in
          range(kolvo)]  # Заполняем список строками, предварительно запросив их
vse_slova = []  # Создаем пустой список
kolvo_slov = 0  # Инициализируем количество слов
for stroka in stroki:  # Перебираем строки
    vse_slova.append(stroka.split())  # Добавляем в список всех слов все строки
for stroka in vse_slova:  # Для каждой строки во всех словах
    for slovo in stroka:  # Находим слово
        kolvo_slov += 1  # И добавляем 1 к счетчику
print(f"Количество слов в веденных строках: {kolvo_slov}")  # Выводим сообщение с количеством слов
